{"user_id":{"0":7216,"1":7228,"2":7229,"3":7239,"4":7240},"post_id":{"0":[771106,771107],"1":[771174],"2":[771174,771175],"3":[771222,771223,771224],"4":[771225]},"past_6_su":{"0":["Indicator","Indicator"],"1":["Ideation"],"2":["Ideation","Ideation"],"3":["Ideation","Ideation","Behavior"],"4":["Indicator"]},"body_pre":{"0":["i am mad i have been diagnosed for 2 years as bp2 but today my psychiatrist told me that she did not actually have bp2 as my diagnosis she was not sure if it was bp2 or bp1 but was leaning towards bp2 but now she is saying i am bp1 my question is why did she never tell me any of this until now i do not think she was even going to bring it up initially we were filling out fmla paperwork and she had to remember what my diagnosis was and when i said bp2 she looked at her notes and said well i actually have you down as bp 1 or 2 i do not know how to feel god damn it plus she does not even take my insurance anymore and that seeing her cost me 230 instead of 25 like it used to fuck it at least my meds work","eating habits dae notice that their eating habits change i will go through phases where i am able to be so on point eat healthy make good choices and then there will be periods usually like a month where i just eat like garbage and feel like i have no self control and gain back the weight i had worked so hard to lose it is so frustrating especially because i lost 20lbs this year and i have gained 5 of it back i know that is not a huge amount but i am a small person so it is noticeable and it is just frustrating to lose it and then gain it back i really want to continue on my healthy lifestyle and eat right and exercise and make physical and mental progress does anyone have any tips for staying on track"],"1":["i cannot take it anymore for the past five days i have had at least one mental breakdown a day sometimes multiple every time i think about something that stresses me out i have to immediately focus my mind on something else or i will have a panic attack at night i cannot sleep because of my frequent attacks and crying spells i have never felt so anxious in my life and i do not know what to do for the past two hours at work i have been trying not to break down and trying not to show it when i go to my psychiatry appointments i always feel fine and then i leave and start feeling awful i am so miserable that i just want to die but i am so afraid of dying that when i think about it i just get more panicky everyone thinks i am okay and because my moods tend to change so quickly no one ever believes when i tell them i am doing so bad and i want to die they think it will pass and i will be fine but the bad feelings always come back and i physically cannot fight this battle any more"],"2":["i cannot take it anymore for the past five days i have had at least one mental breakdown a day sometimes multiple every time i think about something that stresses me out i have to immediately focus my mind on something else or i will have a panic attack at night i cannot sleep because of my frequent attacks and crying spells i have never felt so anxious in my life and i do not know what to do for the past two hours at work i have been trying not to break down and trying not to show it when i go to my psychiatry appointments i always feel fine and then i leave and start feeling awful i am so miserable that i just want to die but i am so afraid of dying that when i think about it i just get more panicky everyone thinks i am okay and because my moods tend to change so quickly no one ever believes when i tell them i am doing so bad and i want to die they think it will pass and i will be fine but the bad feelings always come back and i physically cannot fight this battle any more","i cannot take it anymore x post r bipolar for the past five days i have had at least one mental breakdown a day sometimes multiple every time i think about something that stresses me out i have to immediately focus my mind on something else or i will have a panic attack at night i cannot sleep because of my frequent attacks and crying spells i have never felt so anxious in my life and i do not know what to do for the past two hours at work i have been trying not to break down and trying not to show it when i go to my psychiatry appointments i always feel fine and then i leave and start feeling awful i am so miserable that i just want to die but i am so afraid of dying that when i think about it i just get more panicky everyone thinks i am okay and because my moods tend to change so quickly no one ever believes when i tell them i am doing so bad and i want to die they think it will pass and i will be fine but the bad feelings always come back and i physically cannot fight this battle any more"],"3":["vacation while unstable hi all i have been lurking on this sub for about 2 5 weeks after having been rediagnosed as bp2 by my new pdoc previously diagnosed mdd nov 2015 i have been hypomanic for about 6 weeks now and just started depakote 2 weeks ago and latuda yesterday i am supposed to fly out to new york today to visit a good friend i live in california but yesterday when i met with my pdoc he wanted me to go to the hospital voluntarily so i could get my medication dosages up and going a lot quicker he could not make me go because i am not outright suicidal but i have been extremely irritable and impulsive the past month and a half and he noted that my safety could easily be compromised in a different state with new stressors just looking for some advice from any of you who have more experience with this than i do my judgment is clouded and i really do not know what to do my flight is at 10pm tonight if i decide to go so i still have plenty of time to decide tia","mistakes mistakes so i posted last week about going on a trip across the country when my pdoc told me i should probably go voluntarily to inpatient to stabilize my new meds diagnosed bp2 about a month ago now on depakote and latuda of course i did not listen went on the trip was mixed the whole time and had a crappy experience overall including not being able to get home for an extra day because united cancelled mine and everyone else s flight i came back last night and had to work this morning and i started imagining various ways to get out of work for tomorrow including but not limited to crashing my car on the freeway i thought i was just beyond tired because i was stuck in the airport for 18 hours yesterday and had not slept but after 9 hours last night and having just woken up from another 4 5 hours still feeling like a swift end would be my best bet at this point what do i do i am afraid if i drive i will hurt myself or someone else even just to go to the hospital which is only 5 mins away also live in us so there is no way in hell i am calling 911 help","does anyone else think about how if you tried to kill yourself that no one would come looking for you like if i took all my meds i have accumulated over the years drank all the alcohol i have and passed out no one would find me no one would come looking for a while at least"],"4":["how much i stopped taking my meds 7 8 weeks ago but still have full prescriptions of all 5 how many should i take to knock out for maybe 12 24 hours i have abilify 20mg abilify 5mg lamictal 100 mg paxil 10 mg and klonopin 2 mg or should i go pick up some nyquil to go with it"]},"mh_diag":{"0":1,"1":1,"2":1,"3":1,"4":1},"time":{"0":[1583397655000,1594867586000],"1":[1422425985000],"2":[1422425985000,1422426594000],"3":[1514528125000,1515334496000,1517204284000],"4":[1563127583000]},"fu_30_su":{"0":"Indicator","1":"Ideation","2":"Indicator","3":"Indicator","4":"Attempt"},"mh_prob":{"0":"[1.0239796e-08 1.0000000e+00]","1":"[6.283823e-06 9.999937e-01]","2":"[1.247250e-06 9.999988e-01]","3":"[2.9020378e-10 1.0000000e+00]","4":"[6.3598777e-06 9.9999368e-01]"},"sum_w_mh":{"0":[" The user expresses frustration about their psychiatrist recently clarifying their bipolar disorder diagnosis as BP1 (possibly misdiagnosed as BP2 initially). They are upset that this information was not shared earlier and that their psychiatrist is no longer covered by their insurance, causing increased out-of-pocket expenses for appointments. There's no clear indication of suicide risk in this post based on the given characteristics (never mention direct suicide thoughts, personal history of at-risk). However, the frustration and confusion could potentially be a sign of emotional distress that warrants further assessment."," The user shares fluctuations in their eating habits, sometimes maintaining a healthy diet but then slipping into unhealthy eating patterns for about a month, leading to weight gain. They've lost 20lbs this year and gained back 5, which is frustrusting for them as they want to continue with their healthy lifestyle. This post does not indicate direct suicide thoughts or behaviors, but it falls under the \"never mention direct suicide thoughts, but share personal history of at-risk\" category. The focus here is on struggles with maintaining a healthy lifestyle and seeking tips for staying consistent."],"1":[" The user is experiencing an extreme mental distress, with multiple daily breakdowns and panic attacks triggered by stressors. They have sleep disturbances, excessive anxiety, and frequent crying spells. Despite attending psychiatry appointments where they feel fine temporarily, their negative emotions persistently return. There's a strong expression of suicidal ideation, but also an underlying fear of death. Others tend to dismiss the severity of their condition due to the fluctuating nature of their moods. This situation highlights a significant suicide risk and indicates that the individual is struggling immensely with their mental health."],"2":[" The user is experiencing an extreme mental distress, with multiple daily breakdowns and panic attacks triggered by stressors. They have sleep disturbances, excessive anxiety, and frequent crying spells. Despite attending psychiatry appointments where they feel fine temporarily, their negative emotions persistently return. There's a strong expression of suicidal ideation, but also an underlying fear of death. Others tend to dismiss the severity of their condition due to the fluctuating nature of their moods. This situation highlights a significant suicide risk and indicates that the individual is struggling with overwhelming emotional turmoil."," The user is a bipolar individual who has been experiencing frequent mental breakdowns, panic attacks, and crying spells for the past five days. They are severely anxious, unable to sleep, and have intense suicidal ideations. Despite appearing fine during psychiatry appointments, their mood swings can be rapid, making it difficult for others to understand the severity of their current mental state. The user feels overwhelmed and trapped by these emotions, fearing both death and living with this constant struggle."],"3":[" The user has been diagnosed with Bipolar II (BP2) and was previously diagnosed with Major Depressive Disorder (MDD). They've experienced hypomania for about 6 weeks, started on Depakote two weeks ago and Latuda recently. Their psychiatrist suggested voluntary hospitalization to manage medication dosages more effectively due to irritability and impulsivity. The user is unsure whether they should travel from California to New York given their current mental state, seeking advice from the community. They have time until 10 PM tonight to make a decision about traveling. This situation indicates a high risk of instability and potential impaired judgment, although direct suicide ideation isn't explicitly mentioned."," The user, diagnosed with Bipolar II about a month ago and currently on Depakote and Latuda, disregarded their psychiatrist's advice to voluntarily enter inpatient care for medication stabilization. They went on a cross-country trip while experiencing mixed emotions. After returning home, they had an unpleasant experience at work and started imagining ways to avoid going to work the next day, including crashing their car on the freeway. Despite sleeping for over 13 hours, they still feel like self-harm or suicide would be a preferable option. They are afraid of causing harm to themselves or others while driving and are unsure about how to seek help in the US without calling emergency services (911). This indicates a high level of suicide ideation and potential impulsivity."," The user is expressing thoughts about suicide by considering a specific self-harm scenario involving consuming accumulated medications and alcohol. They also mention that they believe it might take some time before someone would notice their absence, indicating an active behavioral component in their suicidal ideation. This highlights the need for immediate attention and intervention to ensure the user's safety and wellbeing."],"4":[" The user is indicating a potential risk for suicide by expressing the intention to overdose on their prescribed medications (Abilify, Lamictal, Paxil, and Klonopin) or possibly combining them with over-the-counter Nyquil. This post highlights non-compliance with medication regimens and a concerning desire for unconsciousness lasting from 12 to 24 hours. The individual's mental health state appears to be severely compromised, warranting immediate professional intervention and assessment."]}}